Revit 2024 API
ParameterTypeId.StructuralFamilyNameKey Property
 "Family Name Key"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralFamilyNameKey { get; }
Visual Basic
Public Shared ReadOnly Property StructuralFamilyNameKey As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralFamilyNameKey {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace